<a href="https://colab.research.google.com/github/priyanshch1105/Bharatintern/blob/main/titanicchallenges.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
test = pd.read_csv('tested.csv')

In [ ]:
print(test.shape)

In [ ]:
test.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [ ]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 31.1+ KB

In [ ]:
test.drop(columns=['Cabin'],inplace=True)

In [ ]:
test.isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Ticket          0
Fare            1
Embarked        0
dtype: int64

In [ ]:
test['Embarked'].value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [ ]:
test['Fare'].fillna(test['Fare'].mean(),inplace=True)

In [ ]:
test.isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Ticket          0
Fare            0
Embarked        0
dtype: int64

In [ ]:
test_age=np.random.randint(test['Age'].mean()-test['Age'].std(),test['Age'].mean()+test['Age'].std(),86)

In [ ]:
test['Age'][test['Age'].isnull()]=test_age

<ipython-input-261-abf9310a3d93>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  test['Age'][test['Age'].isnull()]=test_age

In [ ]:
test.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
#EDA

In [ ]:
test

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,29.0,0,0,A.5. 3236,8.0500,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,S
416,1308,0,3,"Ware, Mr. Frederick",male,27.0,0,0,359309,8.0500,S
417,1309,0,3,"Peter, Master. Michael J",male,28.0,1,1,2668,22.3583,C

In [ ]:
test.groupby(['Pclass'])['Survived'].mean()

Pclass
1    0.467290
2    0.322581
3    0.330275
Name: Survived, dtype: float64

In [ ]:
test.groupby(['Sex'])['Survived'].mean()

Sex
female    1.0
male      0.0
Name: Survived, dtype: float64

In [ ]:
test.groupby(['Name'])['Survived'].mean()

Name
Abbott, Master. Eugene Joseph                    0.0
Abelseth, Miss. Karen Marie                      1.0
Abelseth, Mr. Olaus Jorgensen                    0.0
Abrahamsson, Mr. Abraham August Johannes         0.0
Abrahim, Mrs. Joseph (Sophie Halaut Easu)        1.0
                                                ...
de Brito, Mr. Jose Joaquim                       0.0
de Messemaeker, Mr. Guillaume Joseph             0.0
del Carlo, Mrs. Sebastiano (Argenia Genovesi)    1.0
van Billiard, Master. James William              0.0
van Billiard, Master. Walter John                0.0
Name: Survived, Length: 418, dtype: float64

In [ ]:
test.groupby(['Age'])['Survived'].mean()

Age
0.17     1.000000
0.33     0.000000
0.75     0.000000
0.83     0.000000
0.92     1.000000
           ...
62.00    0.000000
63.00    0.500000
64.00    0.666667
67.00    0.000000
76.00    1.000000
Name: Survived, Length: 79, dtype: float64

In [ ]:
test.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.392157
Q    0.521739
S    0.325926
Name: Survived, dtype: float64

In [ ]:
test.groupby(['Fare'])['Survived'].mean()

Fare
0.0000      0.0
3.1708      0.0
6.4375      0.0
6.4958      0.0
6.9500      1.0
           ...
227.5250    0.0
247.5208    1.0
262.3750    0.6
263.0000    1.0
512.3292    1.0
Name: Survived, Length: 170, dtype: float64

In [ ]:
test.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
sns.distplot(test['Age'][test['Survived']==0])
sns.distplot(test['Age'][test['Survived']==1])

In [ ]:
sns.distplot(test['Fare'][test['Survived']==0])
sns.distplot(test['Fare'][test['Survived']==1])

In [ ]:
test.isnull().sum()

In [ ]:
test.drop(columns=['Ticket'],inplace=True)

In [ ]:
test['family']=test['SibSp']+test['Parch']+1

In [ ]:
test['family'].value_counts()

1     253
2      74
3      57
4      14
5       7
7       4
11      4
6       3
8       2
Name: family, dtype: int64

In [ ]:
test.groupby(['family'])['Survived'].mean()

family
1     0.268775
2     0.486486
3     0.526316
4     0.714286
5     0.285714
6     0.666667
7     0.250000
8     0.500000
11    0.500000
Name: Survived, dtype: float64

In [ ]:
def cal(number):
    if number == 1:
        return "Alone"
    elif number>1 and number<5:
        return "Medium"
    else:
        return "Large"

In [ ]:
test['family_size']=test['family'].apply(cal)

In [ ]:
test.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,family,family_size
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q,1,Alone
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S,2,Medium
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q,1,Alone
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S,1,Alone
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S,3,Medium

In [ ]:
test.drop(columns=['SibSp','Parch','family'],inplace=True)

In [ ]:
test.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
Fare           0
Embarked       0
family_size    0
dtype: int64

In [ ]:
print(test.shape)

(418, 9)

In [ ]:
passengerId=test['PassengerId'].values

In [ ]:
test.drop(columns=['Name','PassengerId'],inplace=True)

In [ ]:
test.isnull().sum()

Survived       0
Pclass         0
Sex            0
Age            0
Fare           0
Embarked       0
family_size    0
dtype: int64

In [ ]:
test.shape

(418, 7)

In [ ]:
pd.get_dummies(test,columns=['Pclass','Sex','Embarked','family_size'],drop_first=True)

,Survived,Age,Fare,Pclass_2,Pclass_3,Sex_male,Embarked_Q,Embarked_S,family_size_Large,family_size_Medium
0,0,34.5,7.8292,0,1,1,1,0,0,0
1,1,47.0,7.0000,0,1,0,0,1,0,1
2,0,62.0,9.6875,1,0,1,1,0,0,0
3,0,27.0,8.6625,0,1,1,0,1,0,0
4,1,22.0,12.2875,0,1,0,0,1,0,1
...,...,...,...,...,...,...,...,...,...,...
413,0,29.0,8.0500,0,1,1,0,1,0,0
414,1,39.0,108.9000,0,0,0,0,0,0,0
415,0,38.5,7.2500,0,1,1,0,1,0,0
416,0,27.0,8.0500,0,1,1,0,1,0,0
417,0,28.0,22.3583,0,1,1,0,0,0,1

In [ ]:
test.shape

(418, 7)

In [ ]:
X=test.iloc[:,1:].values
y=test.iloc[:,0].values

In [ ]:
from sklearn.model_selection import test_split
X_test,y_test=test_split(X,y,test_size=0.2)

In [ ]:
from sklearn.tree import DecisionTreeClassifier
classifier = DecisionTreeClassifier()

In [ ]:
classifier.fit(X_test,y_test)

In [ ]:
y_pred=classifier.predict(X_test)

In [ ]:
from sklearn.metrics import accuracy_score
accuracy_score(y_pred,y_test)

In [ ]:
Xf = test.iloc[:,:].values

In [ ]:
y_final=classifier.predict(Xf)

In [ ]:
y_final.shape

In [ ]:
passengerId.shape

(418,)

In [ ]:
final = pd.DataFrame()

In [ ]:
final

Empty DataFrame
Columns: []
Index: []

In [ ]:
final['passengerId']=passengerId
final['survived']=y_final

In [ ]:
final

     passengerId
0            892
1            893
2            894
3            895
4            896
..           ...
413         1305
414         1306
415         1307
416         1308
417         1309

[418 rows x 1 columns]

In [ ]:
final.to_csv('submission.csv',index=False)